export const NextAuthErrorDictionary = {
  Configuration:
    'Виникла проблема із конфігурацією сервера. Будь ласка, перевірте налаштування, щоб впевнитися, що все в порядку',
  AccessDenied:
    "Ви були обмежені в доступі до цієї функції. Якщо ви вважаєте, що це помилка, будь ласка, зв'яжіться з підтримкою",
  Verification:
    "Токен може бути або простроченим, або вже використаним. Будь ласка, запросіть новий токен або зв'яжіться з підтримкою для отримання допомоги",
  OAuthSignin:
    'Виникла проблема у підготовці авторизації. Будь ласка, спробуйте ще раз, і якщо проблема продовжується, повідомте нас',
  OAuthCallback:
    "Виникла проблема під час обробки відповіді від постачальника OAuth. Будь ласка, спробуйте ще раз, і якщо проблема триває, зв'яжіться з нами",
  OAuthCreateAccount:
    "Ми не змогли створити ваш обліковий запис із постачальником OAuth. Будь ласка, спробуйте інший спосіб реєстрації або зв'яжіться із підтримкою",
  EmailCreateAccount:
    "Ми не змогли створити ваш обліковий запис. Будь ласка, перевірте свою адресу електронної пошти та спробуйте ще раз, або зв'яжіться із підтримкою для отримання допомоги",
  Callback:
    'Щось пішло не так у нашій обробці зворотнього виклику. Будь ласка, спробуйте ще раз, і якщо проблема продовжується, повідомте нас',
  OAuthAccountNotLinked:
    "Ваша адреса електронної пошти вже пов'язана із іншим обліковим записом, але не із цим. Будь ласка, увійдіть із початковим обліковим записом",
  EmailSignin:
    "Помилка надсилання електронного листа із верифікаційним токеном. Будь ласка, перевірте адресу електронної пошти та спробуйте ще раз, або зв'яжіться з підтримкою для отримання допомоги",
  CredentialsSignin:
    'Наданий ідентифікатор або пароль недійсні. Будь ласка, переконайтеся, що ваш ідентифікатор та пароль вірні, або скористайтеся іншим методом входу',
  SessionRequired:
    "Для доступу до цього вмісту ви повинні бути авторизовані постійно. Будь ласка, увійдіть, або зв'яжіться з підтримкою, якщо вам потрібна допомога",
  Default:
    "Щось пішло не так... Будь ласка, спробуйте ще раз, і якщо проблема продовжується, зв'яжіться із нашою службою підтримки",
};
